{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"encoder_input","class_name":"InputLayer","config":{"batch_input_shape":[null,100,100,3],"dtype":"float32","sparse":false,"name":"encoder_input"},"inbound_nodes":[]},{"name":"encoder_conv_0","class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"encoder_conv_0","trainable":true},"inbound_nodes":[[["encoder_input",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU1","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU1","trainable":true},"inbound_nodes":[[["encoder_conv_0",0,0,{}]]]},{"name":"encoder_conv_1","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"encoder_conv_1","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU1",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU2","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU2","trainable":true},"inbound_nodes":[[["encoder_conv_1",0,0,{}]]]},{"name":"encoder_conv_2","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"encoder_conv_2","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU2",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU3","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU3","trainable":true},"inbound_nodes":[[["encoder_conv_2",0,0,{}]]]},{"name":"encoder_conv_3","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"encoder_conv_3","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU3",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU4","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU4","trainable":true},"inbound_nodes":[[["encoder_conv_3",0,0,{}]]]},{"name":"flatten_Flatten1","class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU4",0,0,{}]]]},{"name":"mean","class_name":"Dense","config":{"units":2,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"mean","trainable":true},"inbound_nodes":[[["flatten_Flatten1",0,0,{}]]]},{"name":"LogVariance","class_name":"Dense","config":{"units":2,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"LogVariance","trainable":true},"inbound_nodes":[[["flatten_Flatten1",0,0,{}]]]},{"name":"sampling_layer_samplingLayer1","class_name":"samplingLayer","config":{"name":"sampling_layer_samplingLayer1","trainable":true,"epsilon":null},"inbound_nodes":[[["mean",0,0,{}],["LogVariance",0,0,{}]]]}],"input_layers":[["encoder_input",0,0]],"output_layers":[["mean",0,0],["LogVariance",0,0],["sampling_layer_samplingLayer1",0,0]]},"keras_version":"tfjs-layers 1.7.3","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.7.3","convertedBy":null,"weightsManifest":[{"paths":["./VAE_encoder.weights.bin"],"weights":[{"name":"encoder_conv_0/kernel","shape":[3,3,3,32],"dtype":"float32"},{"name":"encoder_conv_0/bias","shape":[32],"dtype":"float32"},{"name":"encoder_conv_1/kernel","shape":[3,3,32,64],"dtype":"float32"},{"name":"encoder_conv_1/bias","shape":[64],"dtype":"float32"},{"name":"encoder_conv_2/kernel","shape":[3,3,64,64],"dtype":"float32"},{"name":"encoder_conv_2/bias","shape":[64],"dtype":"float32"},{"name":"encoder_conv_3/kernel","shape":[3,3,64,64],"dtype":"float32"},{"name":"encoder_conv_3/bias","shape":[64],"dtype":"float32"},{"name":"mean/kernel","shape":[40000,2],"dtype":"float32"},{"name":"mean/bias","shape":[2],"dtype":"float32"},{"name":"LogVariance/kernel","shape":[40000,2],"dtype":"float32"},{"name":"LogVariance/bias","shape":[2],"dtype":"float32"}]}]}