{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v1.7.3", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "encoder_conv_0/kernel", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "encoder_conv_0/bias", "shape": [32], "dtype": "float32"}, {"name": "encoder_conv_1/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "encoder_conv_1/bias", "shape": [64], "dtype": "float32"}, {"name": "encoder_conv_2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "encoder_conv_2/bias", "shape": [64], "dtype": "float32"}, {"name": "encoder_conv_3/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "encoder_conv_3/bias", "shape": [64], "dtype": "float32"}, {"name": "encoder_output/kernel", "shape": [3136, 2], "dtype": "float32"}, {"name": "encoder_output/bias", "shape": [2], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [2, 3136], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [3136], "dtype": "float32"}, {"name": "decoder_conv_t_0/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "decoder_conv_t_0/bias", "shape": [64], "dtype": "float32"}, {"name": "decoder_conv_t_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "decoder_conv_t_1/bias", "shape": [64], "dtype": "float32"}, {"name": "decoder_conv_t_2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "decoder_conv_t_2/bias", "shape": [32], "dtype": "float32"}, {"name": "decoder_conv_t_3/kernel", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "decoder_conv_t_3/bias", "shape": [1], "dtype": "float32"}]}]}